Revit 2017 API
RevitLinkLoadResult.GetModelName Method
 Gets the name of the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
public ModelPath GetModelName()
Visual Basic
Public Function GetModelName As ModelPath
Visual C++
public:
ModelPath^ GetModelName()
See Also
RevitLinkLoadResult Class
Autodesk.Revit.DB Namespace